In [1]:
#loading libraries
import pandas as pd

In [3]:
#loading dataset usimg pandas
df =pd.read_csv("employee_data.csv")

In [11]:
#checking shape of dataset like number of rows and columns
df.shape

(500, 6)

In [12]:
#checking null values in the dataset
df.isnull().sum()

EmployeeID      0
Name           50
Department     50
Salary         50
JoiningDate    50
Status         50
dtype: int64

In [13]:
#getting breif information about the dataset
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   EmployeeID   500 non-null    int64
 1   Name         450 non-null    object
 2   Department   450 non-null    object
 3   Salary       450 non-null    float64
 4   JoiningDate  450 non-null    object
 5   Status       450 non-null    object
dtypes: float64(1), int64(1), object(4)
memory usage: 23.6+ KB

In [15]:
#displaying first 5 rows in the dataset
df.head()

   EmployeeID             Name  Department    Salary JoiningDate      Status
0        7970              NaN  Operations   44168.0  2023-04-16  Terminated
1        1752   Shannon Franco          HR   80140.0  2016-08-22  Terminated
2        8478              NaN          HR  144316.0  2023-11-04  Terminated
3        5157  Barbara Alvarez  Operations   35075.0  2023-04-22         NaN
4        1816        Adam Cobb       Sales  142537.0  2016-05-12      Active

In [16]:
#droping duplicates present in the dataset
df.drop_duplicates(inplace=True)

In [42]:
#filling missing values in the department column with not known
#filling missing values in the Name column with not known
#filling missing values in the status column with active
df["Department"].fillna("Not known",inplace=True)
df["Name"].fillna("Not known",inplace=True)
df["Status"].fillna("Active",inplace=True)

In [43]:
#checking to see whether the missing value is filled or not
df.head()

   EmployeeID             Name  Department    Salary JoiningDate      Status
0        7970        Not known  Operations   44168.0  2023-04-16  Terminated
1        1752   Shannon Franco          HR   80140.0  2016-08-22  Terminated
2        8478        Not known          HR  144316.0  2023-11-04  Terminated
3        5157  Barbara Alvarez  Operations   35075.0  2023-04-22      Active
4        1816        Adam Cobb       Sales  142537.0  2016-05-12      Active

In [58]:
#filling salary column with mean
mean=df["Salary"].mean
df["Salary"].fillna(mean, inplace=True)

In [59]:
#dropping remaining null values
df.dropna(inplace=True)

In [60]:
#all data is cleaned
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 450 entries, 0 to 499
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   EmployeeID   450 non-null    int64
 1   Name         450 non-null    object
 2   Department   450 non-null    object
 3   Salary       450 non-null    object
 4   JoiningDate  450 non-null    object
 5   Status       450 non-null    object
dtypes: int64(1), object(5)
memory usage: 24.6+ KB

In [62]:
print(df["Status"].str.lower() != Resigned)

NameError: name 'Resigned' is not defined

In [66]:
avg_slary = df.groupby("Department")

In [64]:
print(avg_slary.mean)

<bound method GroupBy.mean of <pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001A8E3C0C8F0>>